STMicroelectronics/stm32u083c-dk-bsp/stm32u083c_discovery_glass_lcd.h
#define LCD_DIGIT1_COM1               LCD_COM1
#define LCD_DIGIT1_COM1_SEG_MASK      ~(LCD_SEG0 | LCD_SEG1 | LCD_SEG23)
#define LCD_DIGIT1_COM1_1             LCD_COM1_1
#define LCD_DIGIT1_COM1_1_SEG_MASK    ~(LCD_SEG22)


#define LCD_DIGIT1_COM2               LCD_COM2
#define LCD_DIGIT1_COM2_SEG_MASK      ~(LCD_SEG0 | LCD_SEG1 | LCD_SEG23)
#define LCD_DIGIT1_COM2_1             LCD_COM2_1
#define LCD_DIGIT1_COM2_1_SEG_MASK    ~(LCD_SEG22)


#define LCD_DIGIT1_COM3               LCD_COM3
#define LCD_DIGIT1_COM3_SEG_MASK      ~(LCD_SEG0 | LCD_SEG1 | LCD_SEG23)
#define LCD_DIGIT1_COM3_1             LCD_COM3_1
#define LCD_DIGIT1_COM3_1_SEG_MASK    ~(LCD_SEG22)
#endif /* USE_STM32U083C_DISCO_REVB || USE_STM32U083C_DISCO_REVC */


#define LCD_DIGIT2_COM0               LCD_COM0
#define LCD_DIGIT2_COM0_SEG_MASK      ~(LCD_SEG2)
#define LCD_DIGIT2_COM0_1             LCD_COM0_1
#define LCD_DIGIT2_COM0_1_SEG_MASK    ~(LCD_SEG3 | LCD_SEG20 | LCD_SEG21)


#define LCD_DIGIT2_COM1               LCD_COM1
#define LCD_DIGIT2_COM1_SEG_MASK      ~(LCD_SEG2)
#define LCD_DIGIT2_COM1_1             LCD_COM1_1
#define LCD_DIGIT2_COM1_1_SEG_MASK    ~(LCD_SEG3 | LCD_SEG20 | LCD_SEG21)


#define LCD_DIGIT2_COM2               LCD_COM2
#define LCD_DIGIT2_COM2_SEG_MASK      ~(LCD_SEG2)
#define LCD_DIGIT2_COM2_1             LCD_COM2_1
#define LCD_DIGIT2_COM2_1_SEG_MASK    ~(LCD_SEG3 | LCD_SEG20 | LCD_SEG21)


#define LCD_DIGIT2_COM3               LCD_COM3
#define LCD_DIGIT2_COM3_SEG_MASK      ~(LCD_SEG2)
#define LCD_DIGIT2_COM3_1             LCD_COM3_1
#define LCD_DIGIT2_COM3_1_SEG_MASK    ~(LCD_SEG3 | LCD_SEG20 | LCD_SEG21)


#define LCD_DIGIT3_COM0_1               LCD_COM0_1
#define LCD_DIGIT3_COM0_1_SEG_MASK      ~(LCD_SEG4 | LCD_SEG5 | LCD_SEG18 | LCD_SEG19)

#define LCD_DIGIT3_COM1_1               LCD_COM1_1
#define LCD_DIGIT3_COM1_1_SEG_MASK      ~(LCD_SEG4 | LCD_SEG5 | LCD_SEG18 | LCD_SEG19)

#define LCD_DIGIT3_COM2_1               LCD_COM2_1
#define LCD_DIGIT3_COM2_1_SEG_MASK      ~(LCD_SEG4 | LCD_SEG5 | LCD_SEG18 | LCD_SEG19)

#define LCD_DIGIT3_COM3_1               LCD_COM3_1
#define LCD_DIGIT3_COM3_1_SEG_MASK      ~(LCD_SEG4 | LCD_SEG5 | LCD_SEG18 | LCD_SEG19)

#if defined (USE_STM32U083C_DISCO_REVB) || defined (USE_STM32U083C_DISCO_REVC)
#define LCD_DIGIT4_COM0               LCD_COM0
#define LCD_DIGIT4_COM0_SEG_MASK      ~(LCD_SEG6 |LCD_SEG7)
#define LCD_DIGIT4_COM0_1             LCD_COM0_1
#define LCD_DIGIT4_COM0_1_SEG_MASK    ~( LCD_SEG17 | LCD_SEG16)

#define LCD_DIGIT4_COM1               LCD_COM1
#define LCD_DIGIT4_COM1_SEG_MASK      ~(LCD_SEG6 |LCD_SEG7)
#define LCD_DIGIT4_COM1_1             LCD_COM1_1
#define LCD_DIGIT4_COM1_1_SEG_MASK    ~( LCD_SEG17 | LCD_SEG16)

#define LCD_DIGIT4_COM2               LCD_COM2
#define LCD_DIGIT4_COM2_SEG_MASK      ~(LCD_SEG6 |LCD_SEG7)
#define LCD_DIGIT4_COM2_1             LCD_COM2_1
#define LCD_DIGIT4_COM2_1_SEG_MASK    ~( LCD_SEG17 | LCD_SEG16)

#define LCD_DIGIT4_COM3               LCD_COM3
#define LCD_DIGIT4_COM3_SEG_MASK      ~(LCD_SEG6 |LCD_SEG7)
#define LCD_DIGIT4_COM3_1             LCD_COM3_1
#define LCD_DIGIT4_COM3_1_SEG_MASK    ~( LCD_SEG17 | LCD_SEG16)
#elif defined (USE_STM32U083C_DISCO_REVA)
#define LCD_DIGIT4_COM0               LCD_COM0
#define LCD_DIGIT4_COM0_SEG_MASK      ~(LCD_SEG6 |LCD_SEG7 | LCD_SEG16)
#define LCD_DIGIT4_COM0_1             LCD_COM0_1
#define LCD_DIGIT4_COM0_1_SEG_MASK    ~( LCD_SEG17)

#define LCD_DIGIT4_COM1               LCD_COM1
#define LCD_DIGIT4_COM1_SEG_MASK      ~(LCD_SEG6 |LCD_SEG7 | LCD_SEG16)
#define LCD_DIGIT4_COM1_1             LCD_COM1_1
#define LCD_DIGIT4_COM1_1_SEG_MASK    ~( LCD_SEG17)

#define LCD_DIGIT4_COM2               LCD_COM2
#define LCD_DIGIT4_COM2_SEG_MASK      ~(LCD_SEG6 |LCD_SEG7 | LCD_SEG16)
#define LCD_DIGIT4_COM2_1             LCD_COM2_1
#define LCD_DIGIT4_COM2_1_SEG_MASK    ~( LCD_SEG17)

#define LCD_DIGIT4_COM3               LCD_COM3
#define LCD_DIGIT4_COM3_SEG_MASK      ~(LCD_SEG6 |LCD_SEG7 | LCD_SEG16)
#define LCD_DIGIT4_COM3_1             LCD_COM3_1
#define LCD_DIGIT4_COM3_1_SEG_MASK    ~( LCD_SEG17)
#endif /* USE_STM32U083C_DISCO_REVB || USE_STM32U083C_DISCO_REVC */


#define LCD_DIGIT5_COM0               LCD_COM0
#define LCD_DIGIT5_COM0_SEG_MASK      ~(LCD_SEG9 | LCD_SEG14 |LCD_SEG8 | LCD_SEG15)

#define LCD_DIGIT5_COM1               LCD_COM1
#define LCD_DIGIT5_COM1_SEG_MASK      ~(LCD_SEG9 | LCD_SEG14 |LCD_SEG8 | LCD_SEG15)

#define LCD_DIGIT5_COM2               LCD_COM2
#define LCD_DIGIT5_COM2_SEG_MASK      ~(LCD_SEG9 | LCD_SEG14 |LCD_SEG8 | LCD_SEG15)

#define LCD_DIGIT5_COM3               LCD_COM3
#define LCD_DIGIT5_COM3_SEG_MASK      ~(LCD_SEG9 | LCD_SEG14 |LCD_SEG8 | LCD_SEG15)


#define LCD_DIGIT6_COM0               LCD_COM0
#define LCD_DIGIT6_COM0_SEG_MASK      ~(LCD_SEG10 |  LCD_SEG13)
#define LCD_DIGIT6_COM0_1             LCD_COM0_1
#define LCD_DIGIT6_COM0_1_SEG_MASK      ~(LCD_SEG11 | LCD_SEG12 )


#define LCD_DIGIT6_COM1               LCD_COM1
#define LCD_DIGIT6_COM1_SEG_MASK      ~(LCD_SEG10 | LCD_SEG13)
#define LCD_DIGIT6_COM1_1             LCD_COM1_1
#define LCD_DIGIT6_COM1_1_SEG_MASK    ~(LCD_SEG11 | LCD_SEG12 )


#define LCD_DIGIT6_COM2               LCD_COM2
#define LCD_DIGIT6_COM2_SEG_MASK      ~(LCD_SEG10  | LCD_SEG13)
#define LCD_DIGIT6_COM2_1             LCD_COM2_1
#define LCD_DIGIT6_COM2_1_SEG_MASK    ~(LCD_SEG11 | LCD_SEG12 )

#define LCD_DIGIT6_COM3               LCD_COM3
#define LCD_DIGIT6_COM3_SEG_MASK      ~(LCD_SEG10 | LCD_SEG13)
#define LCD_DIGIT6_COM3_1             LCD_COM3_1
#define LCD_DIGIT6_COM3_1_SEG_MASK    ~(LCD_SEG11 | LCD_SEG12 )


/**
  * @brief LCD Bar location
  */
#define LCD_BAR0_COM              LCD_COM3_1
#define LCD_BAR1_COM              LCD_COM2_1
#define LCD_BAR2_COM              LCD_COM3
#define LCD_BAR3_COM              LCD_COM2
#define LCD_BAR0_SEG              LCD_SEG11
#define LCD_BAR1_SEG              LCD_SEG11
#define LCD_BAR2_SEG              LCD_SEG9
#define LCD_BAR3_SEG              LCD_SEG9
#define LCD_BAR0_SEG_MASK       ~(LCD_BAR0_SEG)
#define LCD_BAR1_SEG_MASK       ~(LCD_BAR1_SEG)
#define LCD_BAR2_SEG_MASK       ~(LCD_BAR2_SEG)
#define LCD_BAR3_SEG_MASK       ~(LCD_BAR3_SEG)
/**
  * @brief LCD segments & coms redefinition.
  * LCD component segments & coms are not necessarily link to MCU segmnents & coms output.
  */
#if defined (USE_STM32U083C_DISCO_REVB) || defined (USE_STM32U083C_DISCO_REVC)
#define LCD_COM0          MCU_LCD_COM0
#define LCD_COM0_1        MCU_LCD_COM0_1
#define LCD_COM1          MCU_LCD_COM1
#define LCD_COM1_1        MCU_LCD_COM1_1
#define LCD_COM2          MCU_LCD_COM2
#define LCD_COM2_1        MCU_LCD_COM2_1
#define LCD_COM3          MCU_LCD_COM3
#define LCD_COM3_1        MCU_LCD_COM3_1
#elif defined (USE_STM32U083C_DISCO_REVA)
#define LCD_COM0          MCU_LCD_COM4
#define LCD_COM0_1        MCU_LCD_COM4_1
#define LCD_COM1          MCU_LCD_COM5
#define LCD_COM1_1        MCU_LCD_COM5_1
#define LCD_COM2          MCU_LCD_COM6
#define LCD_COM2_1        MCU_LCD_COM6_1
#define LCD_COM3          MCU_LCD_COM7
#define LCD_COM3_1        MCU_LCD_COM7_1
#endif /* USE_STM32U083C_DISCO_REVB || USE_STM32U083C_DISCO_REVC */

