STMicroelectronics/stm32u083c-dk-bsp/stm32u083c_discovery_glass_lcd.h
#define LCD_SEG0          MCU_LCD_SEG22
#define LCD_SEG1          MCU_LCD_SEG23
#define LCD_SEG2          MCU_LCD_SEG6
#define LCD_SEG3          MCU_LCD_SEG45
#define LCD_SEG4          MCU_LCD_SEG46
#define LCD_SEG5          MCU_LCD_SEG47
#define LCD_SEG6          MCU_LCD_SEG11
#define LCD_SEG7          MCU_LCD_SEG14
#define LCD_SEG8          MCU_LCD_SEG15
#define LCD_SEG9          MCU_LCD_SEG28
#define LCD_SEG10         MCU_LCD_SEG29
#define LCD_SEG11         MCU_LCD_SEG32
#define LCD_SEG12         MCU_LCD_SEG33
#define LCD_SEG13         MCU_LCD_SEG24
#define LCD_SEG14         MCU_LCD_SEG26
#define LCD_SEG15         MCU_LCD_SEG27
#if defined (USE_STM32U083C_DISCO_REVB) || defined (USE_STM32U083C_DISCO_REVC)
#define LCD_SEG16         MCU_LCD_SEG48
#elif defined (USE_STM32U083C_DISCO_REVA)
#define LCD_SEG16         MCU_LCD_SEG17
#endif /* USE_STM32U083C_DISCO_REVB || USE_STM32U083C_DISCO_REVC */
#define LCD_SEG17         MCU_LCD_SEG34
#define LCD_SEG18         MCU_LCD_SEG35
#define LCD_SEG19         MCU_LCD_SEG36
#define LCD_SEG20         MCU_LCD_SEG37
#define LCD_SEG21         MCU_LCD_SEG38
#define LCD_SEG22         MCU_LCD_SEG39
#if defined (USE_STM32U083C_DISCO_REVB) || defined (USE_STM32U083C_DISCO_REVC)
#define LCD_SEG23         MCU_LCD_SEG49
#elif defined (USE_STM32U083C_DISCO_REVA)
#define LCD_SEG23         MCU_LCD_SEG21
#endif /* USE_STM32U083C_DISCO_REVB || USE_STM32U083C_DISCO_REVC */
#define LCD_SEG0_SHIFT          MCU_LCD_SEG22_SHIFT
#define LCD_SEG1_SHIFT          MCU_LCD_SEG23_SHIFT
#define LCD_SEG2_SHIFT          MCU_LCD_SEG6_SHIFT
#define LCD_SEG3_SHIFT          MCU_LCD_SEG45_SHIFT
#define LCD_SEG4_SHIFT          MCU_LCD_SEG46_SHIFT
#define LCD_SEG5_SHIFT          MCU_LCD_SEG47_SHIFT
#define LCD_SEG6_SHIFT          MCU_LCD_SEG11_SHIFT
#define LCD_SEG7_SHIFT          MCU_LCD_SEG14_SHIFT
#define LCD_SEG8_SHIFT          MCU_LCD_SEG15_SHIFT
#define LCD_SEG9_SHIFT          MCU_LCD_SEG28_SHIFT
#define LCD_SEG10_SHIFT         MCU_LCD_SEG29_SHIFT
#define LCD_SEG11_SHIFT         MCU_LCD_SEG32_SHIFT
#define LCD_SEG12_SHIFT         MCU_LCD_SEG33_SHIFT
#define LCD_SEG13_SHIFT         MCU_LCD_SEG24_SHIFT
#define LCD_SEG14_SHIFT         MCU_LCD_SEG26_SHIFT
#define LCD_SEG15_SHIFT         MCU_LCD_SEG27_SHIFT
#if defined (USE_STM32U083C_DISCO_REVB) || defined (USE_STM32U083C_DISCO_REVC)
#define LCD_SEG16_SHIFT         MCU_LCD_SEG48_SHIFT
#elif defined (USE_STM32U083C_DISCO_REVA)
#define LCD_SEG16_SHIFT         MCU_LCD_SEG17_SHIFT
#endif /* USE_STM32U083C_DISCO_REVB || USE_STM32U083C_DISCO_REVC */
#define LCD_SEG17_SHIFT         MCU_LCD_SEG34_SHIFT
#define LCD_SEG18_SHIFT         MCU_LCD_SEG35_SHIFT
#define LCD_SEG19_SHIFT         MCU_LCD_SEG36_SHIFT
#define LCD_SEG20_SHIFT         MCU_LCD_SEG37_SHIFT
#define LCD_SEG21_SHIFT         MCU_LCD_SEG38_SHIFT
#define LCD_SEG22_SHIFT         MCU_LCD_SEG39_SHIFT
#if defined (USE_STM32U083C_DISCO_REVB) || defined (USE_STM32U083C_DISCO_REVC)
#define LCD_SEG23_SHIFT         MCU_LCD_SEG49_SHIFT
#elif defined (USE_STM32U083C_DISCO_REVA)
#define LCD_SEG23_SHIFT         MCU_LCD_SEG21_SHIFT
#endif /* USE_STM32U083C_DISCO_REVB || USE_STM32U083C_DISCO_REVC */

/**
  * @brief STM32 LCD segments & coms definitions.
  */
#define MCU_LCD_COM0          LCD_RAM_REGISTER0
#define MCU_LCD_COM0_1        LCD_RAM_REGISTER1
#define MCU_LCD_COM1          LCD_RAM_REGISTER2
#define MCU_LCD_COM1_1        LCD_RAM_REGISTER3
#define MCU_LCD_COM2          LCD_RAM_REGISTER4
#define MCU_LCD_COM2_1        LCD_RAM_REGISTER5
#define MCU_LCD_COM3          LCD_RAM_REGISTER6
#define MCU_LCD_COM3_1        LCD_RAM_REGISTER7
#define MCU_LCD_COM4          LCD_RAM_REGISTER8
#define MCU_LCD_COM4_1        LCD_RAM_REGISTER9
#define MCU_LCD_COM5          LCD_RAM_REGISTER10
#define MCU_LCD_COM5_1        LCD_RAM_REGISTER11
#define MCU_LCD_COM6          LCD_RAM_REGISTER12
#define MCU_LCD_COM6_1        LCD_RAM_REGISTER13
#define MCU_LCD_COM7          LCD_RAM_REGISTER14
#define MCU_LCD_COM7_1        LCD_RAM_REGISTER15
#define MCU_LCD_SEG0          (1U << MCU_LCD_SEG0_SHIFT)
#define MCU_LCD_SEG1          (1U << MCU_LCD_SEG1_SHIFT)
#define MCU_LCD_SEG2          (1U << MCU_LCD_SEG2_SHIFT)
#define MCU_LCD_SEG3          (1U << MCU_LCD_SEG3_SHIFT)
#define MCU_LCD_SEG4          (1U << MCU_LCD_SEG4_SHIFT)
#define MCU_LCD_SEG5          (1U << MCU_LCD_SEG5_SHIFT)
#define MCU_LCD_SEG6          (1U << MCU_LCD_SEG6_SHIFT)
#define MCU_LCD_SEG7          (1U << MCU_LCD_SEG7_SHIFT)
#define MCU_LCD_SEG8          (1U << MCU_LCD_SEG8_SHIFT)
#define MCU_LCD_SEG9          (1U << MCU_LCD_SEG9_SHIFT)
#define MCU_LCD_SEG10         (1U << MCU_LCD_SEG10_SHIFT)
#define MCU_LCD_SEG11         (1U << MCU_LCD_SEG11_SHIFT)
#define MCU_LCD_SEG12         (1U << MCU_LCD_SEG12_SHIFT)
#define MCU_LCD_SEG13         (1U << MCU_LCD_SEG13_SHIFT)
#define MCU_LCD_SEG14         (1U << MCU_LCD_SEG14_SHIFT)
#define MCU_LCD_SEG15         (1U << MCU_LCD_SEG15_SHIFT)
#define MCU_LCD_SEG16         (1U << MCU_LCD_SEG16_SHIFT)
#define MCU_LCD_SEG17         (1U << MCU_LCD_SEG17_SHIFT)
#define MCU_LCD_SEG18         (1U << MCU_LCD_SEG18_SHIFT)
#define MCU_LCD_SEG19         (1U << MCU_LCD_SEG19_SHIFT)
#define MCU_LCD_SEG20         (1U << MCU_LCD_SEG20_SHIFT)
#define MCU_LCD_SEG21         (1U << MCU_LCD_SEG21_SHIFT)
#define MCU_LCD_SEG22         (1U << MCU_LCD_SEG22_SHIFT)
#define MCU_LCD_SEG23         (1U << MCU_LCD_SEG23_SHIFT)
#define MCU_LCD_SEG24         (1U << MCU_LCD_SEG24_SHIFT)
#define MCU_LCD_SEG25         (1U << MCU_LCD_SEG25_SHIFT)
#define MCU_LCD_SEG26         (1U << MCU_LCD_SEG26_SHIFT)
#define MCU_LCD_SEG27         (1U << MCU_LCD_SEG27_SHIFT)
#define MCU_LCD_SEG28         (1U << MCU_LCD_SEG28_SHIFT)
#define MCU_LCD_SEG29         (1U << MCU_LCD_SEG29_SHIFT)
#define MCU_LCD_SEG30         (1U << MCU_LCD_SEG30_SHIFT)
#define MCU_LCD_SEG31         (1U << MCU_LCD_SEG31_SHIFT)
#define MCU_LCD_SEG32         (1U << MCU_LCD_SEG32_SHIFT)
#define MCU_LCD_SEG33         (1U << MCU_LCD_SEG33_SHIFT)
#define MCU_LCD_SEG34         (1U << MCU_LCD_SEG34_SHIFT)
#define MCU_LCD_SEG35         (1U << MCU_LCD_SEG35_SHIFT)
#define MCU_LCD_SEG36         (1U << MCU_LCD_SEG36_SHIFT)
#define MCU_LCD_SEG37         (1U << MCU_LCD_SEG37_SHIFT)
#define MCU_LCD_SEG38         (1U << MCU_LCD_SEG38_SHIFT)
#define MCU_LCD_SEG39         (1U << MCU_LCD_SEG39_SHIFT)
#define MCU_LCD_SEG40         (1U << MCU_LCD_SEG40_SHIFT)
#define MCU_LCD_SEG41         (1U << MCU_LCD_SEG41_SHIFT)
#define MCU_LCD_SEG42         (1U << MCU_LCD_SEG42_SHIFT)
#define MCU_LCD_SEG43         (1U << MCU_LCD_SEG43_SHIFT)
#define MCU_LCD_SEG44         (1U << MCU_LCD_SEG44_SHIFT)
#define MCU_LCD_SEG45         (1U << MCU_LCD_SEG45_SHIFT)
#define MCU_LCD_SEG46         (1U << MCU_LCD_SEG46_SHIFT)
#define MCU_LCD_SEG47         (1U << MCU_LCD_SEG47_SHIFT)
#if defined (USE_STM32U083C_DISCO_REVB) || defined (USE_STM32U083C_DISCO_REVC)
#define MCU_LCD_SEG48         (1U << MCU_LCD_SEG48_SHIFT)
#define MCU_LCD_SEG49         (1U << MCU_LCD_SEG49_SHIFT)
#endif /* USE_STM32U083C_DISCO_REVB || USE_STM32U083C_DISCO_REVC */

#define MCU_LCD_SEG0_SHIFT    0
#define MCU_LCD_SEG1_SHIFT    1
#define MCU_LCD_SEG2_SHIFT    2
#define MCU_LCD_SEG3_SHIFT    3
#define MCU_LCD_SEG4_SHIFT    4
#define MCU_LCD_SEG5_SHIFT    5
#define MCU_LCD_SEG6_SHIFT    6
#define MCU_LCD_SEG7_SHIFT    7
#define MCU_LCD_SEG8_SHIFT    8
#define MCU_LCD_SEG9_SHIFT    9
#define MCU_LCD_SEG10_SHIFT   10
#define MCU_LCD_SEG11_SHIFT   11
#define MCU_LCD_SEG12_SHIFT   12
#define MCU_LCD_SEG13_SHIFT   13
#define MCU_LCD_SEG14_SHIFT   14
#define MCU_LCD_SEG15_SHIFT   15
#define MCU_LCD_SEG16_SHIFT   16
#define MCU_LCD_SEG17_SHIFT   17
#define MCU_LCD_SEG18_SHIFT   18
#define MCU_LCD_SEG19_SHIFT   19
#define MCU_LCD_SEG20_SHIFT   20
#define MCU_LCD_SEG21_SHIFT   21
#define MCU_LCD_SEG22_SHIFT   22
#define MCU_LCD_SEG23_SHIFT   23
#define MCU_LCD_SEG24_SHIFT   24
#define MCU_LCD_SEG25_SHIFT   25
#define MCU_LCD_SEG26_SHIFT   26
#define MCU_LCD_SEG27_SHIFT   27
#define MCU_LCD_SEG28_SHIFT   28
#define MCU_LCD_SEG29_SHIFT   29
#define MCU_LCD_SEG30_SHIFT   30
#define MCU_LCD_SEG31_SHIFT   31
#define MCU_LCD_SEG32_SHIFT   0
#define MCU_LCD_SEG33_SHIFT   1
#define MCU_LCD_SEG34_SHIFT   2
#define MCU_LCD_SEG35_SHIFT   3
#define MCU_LCD_SEG36_SHIFT   4
#define MCU_LCD_SEG37_SHIFT   5
#define MCU_LCD_SEG38_SHIFT   6
#define MCU_LCD_SEG39_SHIFT   7
#define MCU_LCD_SEG40_SHIFT   8
#define MCU_LCD_SEG41_SHIFT   9
#define MCU_LCD_SEG42_SHIFT   10
#define MCU_LCD_SEG43_SHIFT   11
#define MCU_LCD_SEG44_SHIFT   12
#define MCU_LCD_SEG45_SHIFT   13
#define MCU_LCD_SEG46_SHIFT   14
#define MCU_LCD_SEG47_SHIFT   15
#if defined (USE_STM32U083C_DISCO_REVB) || defined (USE_STM32U083C_DISCO_REVC)
#define MCU_LCD_SEG48_SHIFT   16
#define MCU_LCD_SEG49_SHIFT   17
#endif /* USE_STM32U083C_DISCO_REVB || USE_STM32U083C_DISCO_REVC */

/**
  * @brief LCD Pins definition.
  */
#if defined (USE_STM32U083C_DISCO_REVB) || defined (USE_STM32U083C_DISCO_REVC)
#define LCD_GPIO_BANKA_PINS  (GPIO_PIN_8  | GPIO_PIN_9  | GPIO_PIN_10)
#define LCD_GPIO_BANKB_PINS  (GPIO_PIN_1  | GPIO_PIN_9  | GPIO_PIN_11 |   \
                              GPIO_PIN_14 | GPIO_PIN_15)
#define LCD_GPIO_BANKC_PINS  (GPIO_PIN_3  | GPIO_PIN_4  | GPIO_PIN_5  |   \
                              GPIO_PIN_6  | GPIO_PIN_8  | GPIO_PIN_9  |   \
                              GPIO_PIN_10 | GPIO_PIN_11)
#define LCD_GPIO_BANKD_PINS  (GPIO_PIN_0  | GPIO_PIN_1  | GPIO_PIN_3  |   \
                              GPIO_PIN_4  | GPIO_PIN_5  | GPIO_PIN_6  |   \
                              GPIO_PIN_8  | GPIO_PIN_9  | GPIO_PIN_12 |   \
                              GPIO_PIN_13)
#define LCD_GPIO_BANKE_PINS  (GPIO_PIN_7  | GPIO_PIN_8  | GPIO_PIN_9)
#elif defined (USE_STM32U083C_DISCO_REVA)
#define LCD_GPIO_BANKA_PINS  (GPIO_PIN_15)
#define LCD_GPIO_BANKB_PINS  (GPIO_PIN_1  | GPIO_PIN_7  | GPIO_PIN_11 |   \
                              GPIO_PIN_14 | GPIO_PIN_15)
#define LCD_GPIO_BANKC_PINS  (GPIO_PIN_3  | GPIO_PIN_4  | GPIO_PIN_5  |   \
                              GPIO_PIN_6  | GPIO_PIN_8  | GPIO_PIN_9  |   \
                              GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12)
#define LCD_GPIO_BANKD_PINS  (GPIO_PIN_0  | GPIO_PIN_1  | GPIO_PIN_2  |   \
                              GPIO_PIN_3  | GPIO_PIN_4  | GPIO_PIN_5  |   \
                              GPIO_PIN_6  | GPIO_PIN_8  | GPIO_PIN_9  |   \
                              GPIO_PIN_12 | GPIO_PIN_13)
#define LCD_GPIO_BANKE_PINS  (GPIO_PIN_7  | GPIO_PIN_8  | GPIO_PIN_9)
#endif /* USE_STM32U083C_DISCO_REVB || USE_STM32U083C_DISCO_REVC */

/* Define for scrolling sentences*/
#define SCROLL_SPEED_HIGH     150
#define SCROLL_SPEED_MEDIUM   300
#define SCROLL_SPEED_LOW      450

#define DOT                   ((uint16_t) 0x8000 ) /* for add decimal point in string */
#define DOUBLE_DOT            ((uint16_t) 0x4000) /* for add decimal point in string */

